--$Name: SGB 0.38$
--$Version: 0.38$
instead_version "2.2.2";
---------------------------------------------------------------------------------------------------
---------------------------------------------------------------------------------------------
require 'modules/translate' --модуль для поддержки gettext
translate.source = 'ru'; --пока включаем только русский
main = room {
	nam = 'Начало';
	pic = 'pic/prolog/titul.png';
	dsc = function(s)
		pn (txtc([[Игра для 18+]]));
		pn 'Снизу справа кнопка меню, в котором можно поменять разрешение, тему, сохранить и загрузить игру. Также меню вызывается по клавише "Esc".';
	end;
	obj = {
		obj {
			nam = 'first'; dsc = txtc(' {Пропустить пролог}')..'^'; act = code [[ gamefile('main.first.lua', true) ]];
		};
		obj {
			nam = 'пролог'; dsc = txtc(' {Начать с самого начала}'); act = code [[ gamefile('main.second.lua', true) ]];
		};
	}
	
}
